{
  "nav": {
    "home": "Accueil",
    "langue": "en",
    "translate": "translate"
  },
  "home": {
    "title_1": "Ingénieur logiciel",
    "title_2": "full stack",
    "description_1": "Je suis Romain BIZOT, Ingénieur logiciel",
    "description_2": "et passionné par le développement d'applications.",
    "description_3": "Découvrez ce portfolio, une sélection de mes projets personnels.",
    "title_section_1": "Compétences",
    "button_softskill": "Voir les soft Skills",
    "button_hardskill": "Voir les hard Skills",
    "title_section_2": "Mes projets"
  },
  "buttons_label": {
    "github": "Voir le code"
  },
  "skills": {
    "methodology": "méthodologie",
    "project_management": "gestion de projet"
  },
  "tool": {
    "database": "base de données"
  },
  "project_1": {
    "title": "Eduvolution",
    "description": "Projet de fin d'études proposant des formations avec quiz, assistées par un chatbot IA intégré à Google Calendar et Google Classroom.",
    "label": "web"
  },
  "project_2": {
    "title": "Paris sportif",
    "description": "Application de paris sportifs affichant les résultats des matchs et les classements des 5 grands championnats d'Europe via web scraping et permettant de parier.",
    "label": "web"
  },
  "project_details": {
    "title_section_1": "Présentation du projet",
    "title_section_2": "Objectifs du projet",
    "title_section_3": "Compétences travaillées",
    "title_section_4": "Présentation visuel du projet"
  },
  "project_details_1": {
    "description_section_1": "Le projet EduVolution a pour objectif de développer une application de formation en ligne permettant aux professeurs de créer et de gérer des formations pour les élèves. Ces derniers peuvent suivre les cours à leur rythme tout en réalisant des quizs pour évaluer leur progression. L'application repose sur une architecture basée sur plusieurs microservices, dont le principal est développé avec Node.js. Deux autres microservices en Python sont responsables de l’envoi automatisé de mails et de la gestion de l’intelligence artificielle qui anime un chatbot pour accompagner les utilisateurs. Ce chatbot génère des réponses en utilisant le modèle LLaMA-2 de Meta. L'application intègre également des services Google, comme Google Calendar et Google Classroom, pour faciliter la gestion des plannings de cours et la synchronisation des contenus pédagogiques. L’objectif est d’offrir une plateforme intuitive et interactive, où les enseignants peuvent suivre l’évolution de leurs élèves et ajuster les formations en fonction de leurs besoins.",
    "description_section_2": "Ce projet a permis de développer plusieurs compétences techniques clés. La création de microservices avec Node.js et Python a approfondi la gestion des architectures distribuées et l'intégration de services variés. L'utilisation du modèle LLaMA-2 pour la partie intelligence artificielle a permis d'explorer des technologies avancées en machine learning et en traitement du langage naturel. L'implémentation d'un système d'authentification sécurisé via Auth0, couplé aux API de Google, a renforcé les compétences en sécurité et en intégration d'APIs externes. Enfin, le développement de l'interface utilisateur avec React.js et la gestion des données via MongoDB ont permis de solidifier les compétences en développement web et en gestion de bases de données."
  },
  "project_details_2": {
    "description_section_1": "Ce projet simule un site de paris sportifs avec les classements et resultats des matchs des 5 grands championnats récupérés grâce à du web scrapping.\nLe backend possède une API Rest developpé en python. Le frontend lui est développé avec Vuejs.\n Deux bases de données ont été utilisées dans ce projet, une base de donnée non relationnelle : redis et une base de donnée relationnelle : SQLiteStudio.\n Ce projet possède différentes pages telle qu'une interface de connexion et d'inscription, une page d'accueil où il est possible de voir le classement et les matchs d'une journée d'un championnat.\n Il est également possible de voir l'historique des différents paris effectués.",
    "description_section_2": "en cours...."
  }
}
