{
  "nav": {
    "home": "Accueil",
    "langue": "en",
    "translate": "translate"
  },
  "home": {
    "title_1": "Ingénieur logiciel",
    "title_2": "full stack",
    "description_1": "Je suis Romain BIZOT, Ingénieur logiciel",
    "description_2": "et passionné par le développement d'applications.",
    "description_3": "Découvrez ce portfolio, une sélection de mes projets personnels.",
    "title_section_1": "Compétences",
    "button_softskill": "Voir les soft Skills",
    "button_hardskill": "Voir les hard Skills",
    "title_section_2": "Mes projets"
  },
  "buttons_label": {
    "github": "Voir le code"
  },
  "skills": {
    "methodology": "méthodologie",
    "project_management": "gestion de projet"
  },
  "tool": {
    "database": "base de données"
  },
  "project_1": {
    "title": "Eduvolution",
    "description": "Projet de fin d'études proposant des formations avec quiz, assistées par un chatbot IA intégré à Google Calendar et Google Classroom.",
    "label": "web"
  },
  "project_2": {
    "title": "Paris sportif",
    "description": "Application de paris sportifs affichant les résultats des matchs et les classements des 5 grands championnats d'Europe via web scraping et permettant de parier.",
    "label": "web"
  },
  "project_3": {
    "title": "Assistant Agent Immobilier",
    "description": "en cours...",
    "label": "web"
  },
  "project_details": {
    "technical_stack": "Stack technique",
    "tools": "Outils",
    "title_section_1": "Présentation du projet",
    "title_section_2": "Objectifs du projet",
    "title_section_3": "Compétences travaillées",
    "title_section_4": "Présentation du projet",
    "subtitle_section_4": "Vidéo offrant une vue d'ensemble de l'application pour en découvrir les fonctionnalités"
  },
  "project_details_1": {
    "description_section_1": "Réalisé dans le cadre de mon projet de fin d'étude, EduVolution consiste en une application de formation en ligne permettant aux enseignants de créer et gérer des cours. Les élèves suivent les cours à leur rythme et peuvent évaluer leur progression via des quiz le tout relié à certains services Google.",
    "description_section_2": "EduVolution vise à offrir une plateforme flexible pour la gestion de la formation en ligne. Elle permet aux enseignants de suivre les progrès des élèves, d’automatiser certaines tâches (comme l’envoi d’emails) et de personnaliser l’expérience d’apprentissage via un chatbot intelligent. L’intégration de services externes comme Google Calendar et Google ClassRoom simplifie la gestion des plannings et des contenus.",
    "description_section_3": "Le projet a permis de développer des compétences en création de microservices avec Node.js et Python, en intelligence artificielle avec LLaMA-2, en sécurité avec Auth0 et en gestion des API Google. Le développement de l'interface avec React.js et la gestion des données via MongoDB ont aussi renforcé les compétences en développement web et en bases de données."
  },
  "project_details_2": {
    "description_section_1": "Ce projet simule un site de paris sportifs avec les classements et resultats des matchs des 5 grands championnats récupérés grâce à du web scrapping.\nLe backend possède une API Rest developpé en python. Le frontend lui est développé avec Vuejs.\n Deux bases de données ont été utilisées dans ce projet, une base de donnée non relationnelle : redis et une base de donnée relationnelle : SQLiteStudio.\n Ce projet possède différentes pages telle qu'une interface de connexion et d'inscription, une page d'accueil où il est possible de voir le classement et les matchs d'une journée d'un championnat.\n Il est également possible de voir l'historique des différents paris effectués.",
    "description_section_2": "en cours....",
    "description_section_3": "en cours..."
  }
}
